17-sessions-cookies/app/controllers/answers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors"
---
    def new
        @user = session[:user_id] ? User.find(session[:user_id]) : nil
        @instructor = Instructor.all.sample

INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 4], ["cookie_id", 5], ["created_at", "2019-06-13 15:44:47.279094"], ["updated_at", "2019-06-13 15:44:47.279094"], ["user_id", 3]]
INSERT INTO "questions" ("instructor_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["instructor_id", 24], ["created_at", "2019-07-25 13:00:52.905194"], ["updated_at", "2019-07-25 13:00:52.905194"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 22], ["cookie_id", 1], ["created_at", "2019-05-27 13:37:09.937945"], ["updated_at", "2019-05-27 13:37:09.937945"], ["user_id", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sam"], ["created_at", "2019-05-27 13:37:09.927598"], ["updated_at", "2019-05-27 13:37:09.927598"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 17], ["cookie_id", 23], ["created_at", "2019-07-04 15:41:13.246331"], ["updated_at", "2019-07-04 15:41:13.246331"], ["user_id", 1]]
---
    def create
        question = Question.create({instructor_id: params[:answer][:instructor_id]})
        answer = Answer.create(answer_params)
        answer.question = question
        if answer.valid? && answer.user.valid?
            answer.save