15-rails-seven-seas/app/controllers/seas_controller.rb

  def index
    @seas = Sea.all
---
SELECT "seas".* FROM "seas"

  def create
    @sea = Sea.new(sea_params)

    if @sea.valid?
      @sea.save
---
INSERT INTO "seas" ("name", "temperature", "bio", "image_url", "mood", "favorite_color", "scariest_creature", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @sea.update(sea_params)
---
UPDATE "seas" SET "image_url" = ?, "updated_at" = ? WHERE "seas"."id" = ?

  def destroy
    if @sea.destroy
---
DELETE FROM "seas" WHERE "seas"."id" = ?  [["id", 9]]